IDEA Open Model
CoordSystemByVector.VecY Property
Compatible with IDEA StatiCa v 10.1
 Axis Y unit vector
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public Vector3D VecY { get; set; }
Public Property VecY As Vector3D
	Get
	Set
public:
property Vector3D^ VecY {
	Vector3D^ get ();
	void set (Vector3D^ value);
}
Property Value
Type: Vector3D
See Also
Reference
CoordSystemByVector Class
IdeaRS.OpenModel.Geometry3D Namespace